Тестовая_база_ERP_14/src/Documents/АГ_ПланПродаж/АГ_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_ПланПродаж</name>
  <comment>АГ:[+][PLAN_001_1][01.03.2019 10:30][Масгутов]</comment>
  <registerRecords>AccumulationRegister.АГ_ПланыОплатКлиентовПоДаннымМенеджера</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПродажПоКатегориям</registerRecords>
  <registerRecords>AccumulationRegister.АГ_ПланыПродажПоКлиентамИКатегориям</registerRecords>
  <registerRecords>AccumulationRegister.ПланыОплатКлиентов</registerRecords>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.ВидыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_НаСогласованииДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Партнеры</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.АГ_СтатусыПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаПлановогоПоступленияДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварнаяКатегория</name>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДРИМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСоСклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказаноНаСклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСТранзитногоСклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказаноТранзитом</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланРазвития</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/InformationRegisters/АналитикаУчетаПоПартнерам/АналитикаУчетаПоПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаПоПартнерам</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаНоменклатуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <comment>Ожидает переименования в Место хранения</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/АГ_ЦеныНоменклатурныхГрупп/АГ_ЦеныНоменклатурныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АГ_ЦеныНоменклатурныхГрупп</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Металлоцентр</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корректировка</name>
    <type>
      <types>DocumentRef.АГ_КорректировкаЭкземпляраБюджета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Documents/АГ_ПланПродаж/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Заполняет табличную часть "Партнеры" согласно значениям реквизитов документа и параметрам процедуры
//
// Параметры:
//  Отрасль - СправочникСсылка.CRM_Отрасли - фильтр клиентов по отрасли (ПустаяСсылка - все отрасли)
//
Процедура ЗаполнитьПартнеров(Отрасль) Экспорт
				
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отрасль", Отрасль);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	Партнеры.АГ_Статус КАК Статус,
	|	ЛОЖЬ КАК ДобавленВручную
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	(&Отрасль = ЗНАЧЕНИЕ(Справочник.CRM_Отрасли.ПустаяСсылка)
	|			ИЛИ Партнеры.CRM_ОсновнаяОтрасль = &Отрасль)
	|	И Партнеры.Клиент
	|	И Партнеры.ОсновнойМенеджер = &Ответственный
	//<--АГ:[PLAN_0001_1][21.04.2019 13:07:51][Фирсанов О.И.]
	//|	И Партнеры.БизнесРегион = ВЫРАЗИТЬ(&Подразделение КАК Справочник.СтруктураПредприятия).АГ_БизнесРегионМЦ
	//-->АГ:[ PLAN_0001_1 ]
	|	И НЕ Партнеры.ПометкаУдаления
	|	И НЕ Партнеры.АГ_Статус В (ЗНАЧЕНИЕ(Перечисление.АГ_СтатусыПартнеров.ЗакрытыйКлиент), ЗНАЧЕНИЕ(Перечисление.АГ_СтатусыПартнеров.НулевойКлиент), ЗНАЧЕНИЕ(Перечисление.АГ_СтатусыПартнеров.ПрочиеОтношения))";
	
	Партнеры.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

// Заполняет табличную часть "Товары"
//
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - заполнить товары по одному партнеру или по всем
//
Процедура ЗаполнитьТовары(Партнер = Неопределено) Экспорт
	
	Если Партнер = Неопределено Тогда
		МассивПартнеров = Партнеры.ВыгрузитьКолонку("Партнер");
	Иначе
		МассивПартнеров = Новый Массив;
		МассивПартнеров.Добавить(Партнер);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Партнеры", МассивПартнеров);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	ТоварныеКатегории.Номенклатура КАК Номенклатура,
	|	ТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ТоварныеКатегории.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ВсеТоварныеКатегории
	|ИЗ
	|	(ВЫБРАТЬ
	|		Партнеры.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.Партнеры КАК Партнеры
	|	ГДЕ
	|		Партнеры.Ссылка В(&Партнеры)) КАК Партнеры,
	|	(ВЫБРАТЬ
	|		Номенклатуры.Ссылка КАК Номенклатура,
	|		Номенклатуры.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|		Номенклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатуры
	|	ГДЕ
	|		НЕ Номенклатуры.ЭтоГруппа
	//<--АГ:[PLAN_0001_1][03.05.2019 16:07:51][Фирсанов О.И.]
	|		И Номенклатуры.ТоварнаяКатегория <> ЗНАЧЕНИЕ(Справочник.ТоварныеКатегории.ПустаяСсылка)
	//-->АГ:[ PLAN_0001_1 ]
	|		И НЕ Номенклатуры.ПометкаУдаления) КАК ТоварныеКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК КоличествоОтгружено,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот / ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ПродажиПоКлючамАналитик
	|ИЗ
	//<--АГ:[PLAN_0001_1][22.04.2019 19:07:51][Фирсанов О.И.]
	//|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -1), ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, -1), , ) КАК ВыручкаИСебестоимостьПродажОбороты
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -1), ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, -1), ,ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.РеализацияТоваровУслуг).Менеджер=&Ответственный) КАК ВыручкаИСебестоимостьПродажОбороты
	//-->АГ:[ PLAN_0001_1 ]
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикиУчетаПоПартнерам.Партнер КАК Партнер,
	|	АналитикиУчетаНоменклатуры.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	СУММА(ПродажиПоКлючамАналитик.КоличествоОтгружено) КАК КоличествоОтгружено,
	|	СРЕДНЕЕ(ПродажиПоКлючамАналитик.Цена) КАК Цена
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	ПродажиПоКлючамАналитик КАК ПродажиПоКлючамАналитик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|		ПО ПродажиПоКлючамАналитик.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикиУчетаНоменклатуры
	|		ПО ПродажиПоКлючамАналитик.АналитикаУчетаНоменклатуры = АналитикиУчетаНоменклатуры.КлючАналитики
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикиУчетаПоПартнерам.Партнер,
	|	АналитикиУчетаНоменклатуры.Номенклатура.ТоварнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Партнер КАК Партнер,
	|	ВложенныйЗапрос.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ЕСТЬNULL(Продажи.КоличествоОтгружено, 0) КАК КоличествоОтгружено,
	|	ВЫБОР ЕСТЬNULL(Продажи.Цена, 0)
	|		КОГДА 0
	|			ТОГДА ВложенныйЗапрос.Цена
	|		ИНАЧЕ Продажи.Цена
	|	КОНЕЦ КАК Цена,
	|	&ВалютаДокумента КАК Валюта,
	|	ВложенныйЗапрос.ЗаказаноНаСклад КАК ЗаказаноНаСклад,
	|	ВложенныйЗапрос.ЗаказаноТранзитом КАК ЗаказаноТранзитом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВсеТоварныеКатегории.Партнер КАК Партнер,
	|		ВсеТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|		СРЕДНЕЕ(ЕСТЬNULL(АГ_ЦеныНоменклатурныхГруппСрезПоследних.Цена, 0)) КАК Цена,
	|		СУММА(ВЫБОР
	|				КОГДА ЗаказыКлиентовОстатки.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.АГ_Транзитный)
	|					ТОГДА ЕСТЬNULL(ЗаказыКлиентовОстатки.ЗаказаноОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ЗаказаноНаСклад,
	|		СУММА(ВЫБОР
	|				КОГДА ЗаказыКлиентовОстатки.Склад = ЗНАЧЕНИЕ(Справочник.Склады.АГ_Транзитный)
	|					ТОГДА ЗаказыКлиентовОстатки.ЗаказаноОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ЗаказаноТранзитом
	|	ИЗ
	|		ВсеТоварныеКатегории КАК ВсеТоварныеКатегории
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки(
	|					&КонецПериода,
	|					ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|						И (ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).Партнер, Номенклатура) В
	|							(ВЫБРАТЬ
	|								ВсеТоварныеКатегории.Партнер КАК Партнер,
	|								ВсеТоварныеКатегории.Номенклатура КАК Номенклатура
	|							ИЗ
	//<--АГ:[PLAN_0001_1][22.04.2019 19:07:51][Фирсанов О.И.]
	//|								ВсеТоварныеКатегории КАК ВсеТоварныеКатегории)) КАК ЗаказыКлиентовОстатки
	|								ВсеТоварныеКатегории КАК ВсеТоварныеКатегории)
	|	                    И (ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента).Менеджер = &Ответственный)
	|					) КАК ЗаказыКлиентовОстатки
	//-->АГ:[ PLAN_0001_1 ]
	|			ПО (ВсеТоварныеКатегории.Партнер = ВЫРАЗИТЬ(ЗаказыКлиентовОстатки.ЗаказКлиента КАК Документ.ЗаказКлиента).Партнер)
	|				И ВсеТоварныеКатегории.Номенклатура = ЗаказыКлиентовОстатки.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АГ_ЦеныНоменклатурныхГрупп.СрезПоследних(
	|					,
	|					(Металлоцентр, НоменклатурнаяГруппа, Валюта) В
	|						(ВЫБРАТЬ
	|							&Подразделение КАК Подразделение,
	|							ВсеТоварныеКатегории.ВидНоменклатуры КАК ВидНоменклатуры,
	|							&ВалютаДокумента КАК Валюта
	|						ИЗ
	|							ВсеТоварныеКатегории КАК ВсеТоварныеКатегории)) КАК АГ_ЦеныНоменклатурныхГруппСрезПоследних
	|			ПО ВсеТоварныеКатегории.ВидНоменклатуры = АГ_ЦеныНоменклатурныхГруппСрезПоследних.НоменклатурнаяГруппа
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВсеТоварныеКатегории.Партнер,
	|		ВсеТоварныеКатегории.ТоварнаяКатегория) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
	|		ПО ВложенныйЗапрос.Партнер = Продажи.Партнер
	|			И ВложенныйЗапрос.ТоварнаяКатегория = Продажи.ТоварнаяКатегория";
	
	//<--АГ:[PLAN_0001_1][22.04.2019 19:07:51][Фирсанов О.И.]
	Запрос.УстановитьПараметр("Ответственный",Ответственный);
	//-->АГ:[ PLAN_0001_1 ]
	
	Результат = Запрос.Выполнить();
	Если Партнер = Неопределено Тогда
		Товары.Загрузить(Результат.Выгрузить());
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Период = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), 1);
	Ответственный = Пользователи.ТекущийПользователь();
	Подразделение = Ответственный.Подразделение;
	
	ЗаполнитьПартнеров(ПредопределенноеЗначение("Справочник.CRM_Отрасли.ПустаяСсылка"));
	
	ЗаполнитьТовары();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Стр Из Товары Цикл
		
		Если Стр.Количество <> 0 И Стр.Цена = 0 Тогда
			
			ТекстОшибки = НСтр("ru = 'Поле ""Цена за единицу"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Стр.НомерСтроки, "Цена"),
				,
				Отказ);
			
		КонецЕсли;
		
		Если Стр.КоличествоСоСклада < Стр.ЗаказаноНаСклад Тогда
			
			ТекстОшибки = НСтр("ru = 'Поле ""Склад: План продаж (кроме транзитный), тн"" не может быть меньше ""Заказано на склад под покупателя, тн""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Стр.НомерСтроки, "КоличествоСоСклада"),
				,
				Отказ);
			
		КонецЕсли;
		
		Если Стр.КоличествоСТранзитногоСклада < Стр.ЗаказаноТранзитом Тогда
			
			ТекстОшибки = НСтр("ru = 'Поле ""Транзит: План продаж, тн"" не может быть меньше ""Заказано транзитом под покупателя, тн""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Стр.НомерСтроки, "КоличествоСТранзитногоСклада"),
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.АГ_ПланПродаж.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
	РегистрыНакопления.ОборотыБюджетов.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);

	Планирование.ОтразитьПланыОплатКлиентов(ДополнительныеСвойства, Движения, Отказ);
	
	Планирование.ОтразитьПланПродажПоКатегориям(ДополнительныеСвойства, Движения, Отказ);

	//<--АГ:[PLAN_0001_1][03.05.2019 17:07:51][Фирсанов О.И.]
	АГ_ОтразитьДвиженияПоТаблицеАГ_ПланыПродажПоКлиентамИКатегориям(ДополнительныеСвойства, Движения, Отказ);
	АГ_ОтразитьДвиженияПоТаблицеТаблицаАГ_ПланыОплатКлиентовПоДаннымМенеджера(ДополнительныеСвойства, Движения, Отказ);
	//-->АГ:[ PLAN_0001_1 ]

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//<--АГ:[PLAN_0001_1][03.05.2019 17:07:51][Фирсанов О.И.]
Процедура АГ_ОтразитьДвиженияПоТаблицеАГ_ПланыПродажПоКлиентамИКатегориям(ДополнительныеСвойства, Движения, Отказ)

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАГ_ПланыПродажПоКлиентамИКатегориям;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.АГ_ПланыПродажПоКлиентамИКатегориям.Записывать = Истина;
	Движения.АГ_ПланыПродажПоКлиентамИКатегориям.Загрузить(Таблица);

КонецПроцедуры

Процедура АГ_ОтразитьДвиженияПоТаблицеТаблицаАГ_ПланыОплатКлиентовПоДаннымМенеджера(ДополнительныеСвойства, Движения, Отказ)

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАГ_ПланыОплатКлиентовПоДаннымМенеджера;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.АГ_ПланыОплатКлиентовПоДаннымМенеджера.Записывать = Истина;
	Движения.АГ_ПланыОплатКлиентовПоДаннымМенеджера.Загрузить(Таблица);

КонецПроцедуры

//-->АГ:[ PLAN_0001_1 ]

#КонецОбласти	


#КонецЕсли
